docs/tutorial/tutorial.org
#+TITLE: TOT Tutorial
# #+SUBTITLE: for version {{{version}}}, {{{updated}}}

#+AUTHOR: Torsten Anders
# #+EMAIL: test@email.bla
#+SUBAUTHOR: TODO
# #+DATE: April 2021

#+OPTIONS: toc:4 H:8 num:t
# #+OPTIONS: ':t toc:t author:t email:t

# #+SETUPFILE: Setup.org
#+LATEX_HEADER: \input{LatexHeader}

# For music notation, like \Takt
# http://www.ctan.org/pkg/harmony
# http://ctan.space-pro.be/tex-archive/macros/latex/contrib/harmony/harmony.pdf
#+LATEX_HEADER: \usepackage{harmony} 

# Custom fontification theme, see 
#
# https://github.com/fniessen/org-html-themes
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
# #+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-bigblow.setup
#
# Other CSS
# See also https://www.reddit.com/r/emacs/comments/3pvbag/is_there_a_collection_of_css_styles_for_org/
#
# http://thomasf.github.io/solarized-css/
# #+HTML_HEAD: <link href="http://thomasf.github.io/solarized-css/solarized-light.min.css" rel="stylesheet"></link>
#
# https://gongzhitaao.org/orgcss/
# https://laptrinhx.com/simple-and-clean-css-for-org-exported-html-2634084585/
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#
# Only code colours different
# https://emacs.stackexchange.com/questions/7629/the-syntax-highlight-and-indentation-of-source-code-block-in-exported-html-file
# #+HTML_HEAD: <link href="leuven_theme.css" rel="stylesheet">
#+HTML_HEAD: <link href="leuven_theme.css" rel="stylesheet">
# Org-mode default (?)
# https://orgmode.org/manual/CSS-support.html
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style1.css" />
# #+HTML_HEAD_EXTRA: <link rel="alternate stylesheet" type="text/css" href="style2.css" />

* COMMENT Top-level Code

** Lilypond aux defs

#+name: lilyHeader
#+begin_src lilypond :exports none :results silent
\version "2.22.0"
\paper{
indent=0\mm
line-width=140\mm
oddFooterMarkup=##f
oddHeaderMarkup=##f
bookTitleMarkup=##f
scoreTitleMarkup=##f
}
#+end_src

#+name: empty-staff
#+begin_src lilypond :exports none :results silent
<<lilyHeader>>
{
\time 4/1
\override Staff.TimeSignature #'stencil = ##f
\override Staff.BarLine #'stencil = ##f
s1 s1 s1 s1 s1 s1 s1 s1 s1 s1 s1 s1
}
#+end_src


See also empty percussion line in [[id:89D93A0D-58B0-4FEB-8D3B-D28C0656EE11][Rhythmic Dictation]]


* COMMENT Music Notation output

** Fomus

#+begin_src fomus :file test.ly
time 0 dur 1 pitch 60 ;
#+end_src

#+RESULTS:
[[file:test.ly]]
file:test.pdf


#+begin_src fomus :file test.xml
time 0 dur 1 pitch 60 ;
#+end_src

#+RESULTS:
[[file:test.xml]]



** Lilypond

 Inline Lilypond possible, see
 https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-lilypond.html

 #+begin_src lilypond :file Mixolydian.pdf
 \relative c' {
   g a b c d e f g f e d c b a g a b c d e f g f e d c b a g1
 }
 #+end_src

 #+RESULTS:
 [[file:Mixolydian.pdf]]



** ABC notation

   https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-abc.html




* Introduction

This document presents in a tutorial fashion some functionality of the [[https://github.com/tanders/tot][TOT library]] for
[[http://opusmodus.com/][Opusmodus]]. The TOT library is a loose collection of tools for algorithmic composition. Various
functions and independent and their reference documentation is probably sufficient. 

However, this library also implements some features where a number of definitions work
together. This tutorial focusses on documenting such features.

*This document is unfinished...*


* Score processing

  

** Score preview


** Score transformations


* Microtonal and xenharmonic music

** Introduction

   The TOT library greatly expands Opusmodus' builtin support for microtonal music.  Opusmodus'
   builtin support for microtonal music only allows for quarter tones (24 tone equal division of
   the octave, 24-EDO) and eighth tones (48 tone equal division of the octave, 48-EDO). The
   microtonal model of the TOT library, by contrast, allows users to define arbitrary equal
   temperaments (both equal divisions of the octave and other intervals), just intonation (JI) for
   arbitrary prime limits, and arbitrary regular temperaments
   (https://en.xen.wiki/w/Tour_of_Regular_Temperaments). 

   The library provides this tuning universe in a way that is controllable by a single uniform
   notation embedded in [[https://opusmodus.com/forums/tutorials/omn-the-language/][OMN]]. Still, the library tries to keep things relatively clear and simple by
   introducing mainly one actual new accidental symbol, and that symbol will then be combined with
   numbers (for prime limits) to express arbitrary JI pitches, which are then mapped to all the
   possible tunings.  Technically, pitch deflections are expressed by OMN articulations, as a
   library cannot change the underlying OMN pitch format.

   For microtonal playback, the library implements what could be called a subset of [[https://www.midi.org/midi-articles/midi-polyphonic-expression-mpe][MIDI Polyphonic
   Expression (MPE)]], where chords are distributed automatically over multiple MIDI channels so that
   each tone is tuned independently by pitch bend messages. A considerable number of soft synth
   already support MPE directly ([[https://roli.com/mpe][some incomplete list is shown here, scroll down and select Soft
   Synths]]), and every instrument plugin can be relatively easily made to support MPE by
   using multiple instances of that plugin in parallel (e.g., directly in a DAW or with a plugin
   host that itself is also a plugin, like [[https://www.plogue.com/products/bidule.html][Plogue Bidule]]).


   # Now, this is all claiming rather a lot, and the result may not necessarily be perfect (e.g., controlling a non-octave-repeating equal temperament with a notation suitable for JI is possible and works well for some situations, but is perhaps not to everyones liking). 

   # It has been easier than expected to do what I planned when using some unifying ideas proposed by
   # tuning math guys around 20 years ago.
 
   The core idea of this xemharmonic support is that JI, arbitrary equal temperaments and very many
   other tunings (https://en.xen.wiki/w/Tour_of_Regular_Temperaments) can all be expressed as
   regular temperaments. You can find an informal discussion of regular temperaments, its context
   and motivation -- how it extends/generalises many other tone systems -- at this link:
   http://x31eq.com/paradigm.html. Here is another introduction: https://en.xen.wiki/w/Mike%27s_Lectures_On_Regular_Temperament_Theory. 
   

