docs/tutorial/tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-05 Mon 15:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TOT Tutorial</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Torsten Anders" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link href="leuven_theme.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">TOT Tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org898e7b8">1. Introduction</a></li>
<li><a href="#orgcf9dd9d">2. Score processing</a>
<ul>
<li><a href="#org140d119">2.1. Score preview</a></li>
<li><a href="#orgf7fd918">2.2. Score transformations</a></li>
</ul>
</li>
<li><a href="#org95bb267">3. Microtonal and xenharmonic music</a>
<ul>
<li><a href="#org650037b">3.1. Introduction</a></li>
<li><a href="#org2c3e460">3.2. First steps</a></li>
<li><a href="#org01db866">3.3. Defining temperaments and scales</a></li>
<li><a href="#org7bbb358">3.4. Obtaining information</a>
<ul>
<li><a href="#org06f1acf">3.4.1. Information on intervals</a></li>
<li><a href="#org27629e0">3.4.2. Information on scales</a></li>
</ul>
</li>
<li><a href="#orgd2ac3a4">3.5. Defining harmony</a></li>
<li><a href="#org86f9868">3.6. Constraining music to an underlying harmony</a></li>
<li><a href="#orgc1c5bce">3.7. Dynamic temperaments</a></li>
</ul>
</li>
<li><a href="#org3ebd008">4. Form</a></li>
<li><a href="#org6f34ac4">5. Karnatic rhythms</a>
<ul>
<li><a href="#org2d34e69">5.1. Creating a higher-level plan</a></li>
<li><a href="#org51f46d6">5.2. Filling in details</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org898e7b8" class="outline-2">
<h2 id="org898e7b8"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document presents in a tutorial fashion some functionality of the <a href="https://github.com/tanders/tot">TOT library</a> for
<a href="http://opusmodus.com/">Opusmodus</a>. The TOT library is a loose collection of tools for algorithmic composition. Various
functions and independent and their reference documentation is probably sufficient. 
</p>

<p>
However, this library also implements some features where a number of definitions work
together. This tutorial focusses on documenting such features.
</p>

<p>
<b>This document is unfinished&#x2026;</b>
</p>
</div>
</div>


<div id="outline-container-orgcf9dd9d" class="outline-2">
<h2 id="orgcf9dd9d"><span class="section-number-2">2</span> Score processing</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org140d119" class="outline-3">
<h3 id="org140d119"><span class="section-number-3">2.1</span> Score preview</h3>
</div>


<div id="outline-container-orgf7fd918" class="outline-3">
<h3 id="orgf7fd918"><span class="section-number-3">2.2</span> Score transformations</h3>
</div>
</div>


<div id="outline-container-org95bb267" class="outline-2">
<h2 id="org95bb267"><span class="section-number-2">3</span> Microtonal and xenharmonic music</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org650037b" class="outline-3">
<h3 id="org650037b"><span class="section-number-3">3.1</span> Introduction</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The TOT library greatly expands Opusmodus' builtin support for microtonal music.  Opusmodus'
builtin support for microtonal music only allows for quarter tones (24 tone equal division of
the octave, 24-EDO) and eighth tones (48 tone equal division of the octave, 48-EDO). The
microtonal model of the TOT library, by contrast, allows users to define arbitrary equal
temperaments (both equal divisions of the octave and other intervals), just intonation (JI) for
arbitrary prime limits, and arbitrary regular temperaments
(<a href="https://en.xen.wiki/w/Tour_of_Regular_Temperaments">https://en.xen.wiki/w/Tour_of_Regular_Temperaments</a>). 
</p>

<p>
The library provides this tuning universe in a way that is controllable by a single uniform
notation embedded in <a href="https://opusmodus.com/forums/tutorials/omn-the-language/">OMN</a>. Still, the library tries to keep things relatively clear and simple by
introducing mainly one actual new accidental symbol, and that symbol will then be combined with
numbers (for prime limits) to express arbitrary JI pitches, which are then mapped to all the
possible tunings.  Technically, pitch deflections are expressed by OMN articulations, as a
library cannot change the underlying OMN pitch format.
</p>

<p>
For microtonal playback, the library implements what could be called a subset of <a href="https://www.midi.org/midi-articles/midi-polyphonic-expression-mpe">MIDI Polyphonic
Expression (MPE)</a>, where chords are distributed automatically over multiple MIDI channels so that
each tone is tuned independently by pitch bend messages. A considerable number of soft synth
already support MPE directly (<a href="https://roli.com/mpe">some incomplete list is shown here, scroll down and select Soft
Synths</a>), and every instrument plugin can be relatively easily made to support MPE by
using multiple instances of that plugin in parallel (e.g., directly in a DAW or with a plugin
host that itself is also a plugin, like <a href="https://www.plogue.com/products/bidule.html">Plogue Bidule</a>).
</p>


<p>
The core idea of this xemharmonic support is that JI, arbitrary equal temperaments and very many
other tunings (<a href="https://en.xen.wiki/w/Tour_of_Regular_Temperaments">https://en.xen.wiki/w/Tour_of_Regular_Temperaments</a>) can all be expressed as
regular temperaments. You can find an informal discussion of regular temperaments, its context
and motivation &#x2013; how it extends/generalises many other tone systems &#x2013; at this link:
<a href="http://x31eq.com/paradigm.html">http://x31eq.com/paradigm.html</a>. Here is another introduction: <a href="https://en.xen.wiki/w/Mike%27s_Lectures_On_Regular_Temperament_Theory">https://en.xen.wiki/w/Mike%27s_Lectures_On_Regular_Temperament_Theory</a>. 
</p>
</div>
</div>
