docs/tutorial/tutorial.org
** First steps

   Importantly, regular temperaments can all be mapped to JI. Therefore, they can also all by
   notated by a pitch notation capable of notating JI for arbitrary prime limits. So, as a unifying
   pitch notation for all these temperaments I am using such a JI notation. Several recent JI staff
   notations [fn:: I found so far 5 of such JI notations. Examples of highly developed and more
   widely used notations are Sagittal (http://sagittal.org) and the Helmholtz-Ellis JI Pitch
   Notation (https://marsbat.space/pdfs/notation.pdf).] are based on the same fundamental idea: the
   traditional pitch nominals (A, B, C...) and the traditional accidentals (sharp, double-sharp,
   flat...) are denoting tones in a Pythagorean tuning (when the notation is read as a JI
   notation), i.e. the traditional nominals and accidentals notate all the pitches we can reach
   when stacking just fifths (plus their octaves). The core idea of these JI pitch notations is
   that they introduce a new accidental for the comma (https://en.wikipedia.org/wiki/Comma_(music))
   of every prime limit (https://en.wikipedia.org/wiki/Limit_(music)). These notations
   mainly differ in what kind of symbols they propose for these comma-accidentals.

   The JI notation of this library is based on the same principle idea. We notate Pythagorean
   nominals and accidentals using the standard OMN pitch notation. Here is a dominant seventh
   chord, which in a JI interpretation would be tuned in Pythagorean tuning.

 #+begin_src lisp
 (setf pythagorean-seventh '(h c4e4g4bb4))
 #+end_src


 We can play this chord in JI with the TOT macro =def-tempered-score=. This macro does almost
 exactly what the Opusmodus builtin =def-score= does, but it additionally receives a temperament as
 one of its arguments. Also, there are multiple MIDI channels specified per instrument, as
 simultaneous tones are played on different MIDI channels, so they can be tuned individually by
 pitch bend (the macro uses the =def-score= tuning argument in the background).

 #+begin_src lisp
   (def-tempered-score score-name
       (:temperament '31-limit-JI
	:time-signature '(4 4))
     (instr1
      :omn pythagorean-seventh
      :channel '(1 2 3 4)
      :sound 'gm))
 #+end_src

 OK, how about instead of the Pythagorean third we want to use a just major third -- and also a
 harmonic seventh and the 11ths overtone? All pitches that go beyond Pythagorean tuning are
 notated using JI accidentals that express microtonal comma inflections. 

 I suggest we use the letter =K= for marking any OMN attribute that serves as a Komma
 accidental,[fn:: Our letter =K= is similar to the Greek letter kappa, from where the word comma
 comes. (Besides, the letter =C= is already used in OMN for cent values). When extending OMN as
 users by microtonal accidentals, we are restricted to plain ASCII letters and numbers. Most of the
 ASCII special characters are already used for something else in OMN and are therefore unavailable
 for accidental symbols. Also, while the underlying CCL compiler does support unicode, unicode
 support in OMN attribute names is currently limited. I could use greek letters in the names of
 custon OMN attributes, but all unicode symbols I tried -- e.g., any mathematical symbols or arrows
 -- were not supported. Anyway, while such characters could currently not be used for the attribute
 name, they can be used for the string that is then shown for the attribute in the score.] and then
 to simply complement that letter with the digits of the prime of the comma in question. So, the
 OMN accidental for the [[https://en.wikipedia.org/wiki/Syntonic_comma][5-limit comma (the syntonic comma)]] is notated =5K=, the [[https://en.wikipedia.org/wiki/Septimal_comma ][7-limit comma]] is
 notated =7K= and so forth. These accidentals raise the pitch by that comma. For a comma flat, put
 a minus in front of the accidental, e.g., =-5K=. So, here is how we can notate and play[fn::
 Unfortunately, we cannot yet define new shortcuts for the standard Opusmodus editor. I am instead
 using Opusmodus mainly with Emacs, and I defined a shortcut for me for such microtonal snippets
 that calls the TOT function =prevew-score=, which in turn calls =def-tempered-score= with the OMN
 expression before the cursor.] the just harmonic seventh chord.  =1K= is the natural sign, and
 multiple accidental attributes for a chord are assigned in ascending order of chord tones.

 #+begin_src lisp
 (setf 7-limit-seventh '(h c4e4g4bb4 1K+-5K+1K+-7K))
 #+end_src

 #+begin_src lisp 
   (def-tempered-score score-name
       (:temperament '31-limit-JI
	:time-signature '(4 4))
     (instr1
      :omn 7-limit-seventh
      :channel '(1 2 3 4)
      :sound 'gm))
 #+end_src

 JI leads to an infinite number of different pitches. Temperaments reduce that number. So, how about
 we want to play the above chord in, say, 22-tone equal temperament
 (https://en.xen.wiki/w/22edo). We only need to define that temperament. Each regular
 temperament (including all equal temperaments and also JI) is specified by only two settings: a small
 number of generator intervals, and a val for each generator. The vals together specify how each
 prime (up to the prime limit of the temperament) it is mapped to JI. These details are explained
 in the next section. For now, the following code simply shows the definition of 22-EDO, which is pretty brief. 

 #+begin_src lisp
   (deftemperament 7-limit-22-EDO
       ;; List of vals
       (list (list 22
		   (+ 13 22)
		   (+ 7 (* 2 22))
		   (+ 18 (* 2 22))))
     ;; List of generators
     (list (/ 1200.0 22)))
 #+end_src

 After we defined 22-EDO this say, we can play the above chord (and any other 7-limit OMN
 intervals) in this temperament.

 #+begin_src lisp
   (def-tempered-score score-name
       (:temperament '17-limit-22-EDO
	:time-signature '(4 4))
     (instr1
      :omn 7-limit-seventh
      :channel '(1 2 3 4)
      :sound 'gm))
 #+end_src


** Defining temperaments and scales

   We can define arbitrary regular temperaments simply by specifying their vals and generators. This
   section briefly introduces these concept, so that you can define your own temperaments. We will
   first define the temperament for 12-tone equal temperament (12-EDO), because that is most widely
   used and best understood by most Western musicians. 
 
   All pitches of a regular temperament are specified by a small number of /generators/. For an
   equal temperament like 12-EDO, we only need a single generator. We can use the semitone of this
   temperament as its generator. All tones of the temperament 12-EDO can then be derived by
   stacking that interval multiple times. The semitone of 12-EDO and thus our generator is tuned to
   100 [[https://en.wikipedia.org/wiki/Cent_(music)][cents]].
   
   The [[https://en.xen.wiki/w/Val][/vals/]] of a temperament specify how the intervals of the prime frequency ratios 2, 3,
   5... up to the prime limit of our temperament are mapped to intervals in this temperament. 

   *TODO*


#+begin_src lisp
(deftemperament 11-limit-12-EDO
    (list (edo-val 12 '(0 7 4 10 6)))
  '(100.0)
  "12-EDO temperament with an 11-limit mapping.")
#+end_src


** Obtaining information

*** Information on intervals


*** Information on scales


** Defining harmony


** Constraining music to an underlying harmony



