docs/tutorial/tutorial.html


<div id="outline-container-org2c3e460" class="outline-3">
<h3 id="org2c3e460"><span class="section-number-3">3.2</span> First steps</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Importantly, regular temperaments can all be mapped to JI. Therefore, they can also all by
notated by a pitch notation capable of notating JI for arbitrary prime limits. So, as a unifying
pitch notation for all these temperaments I am using such a JI notation. Several recent JI staff
notations <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> are based on the same fundamental idea: the
traditional pitch nominals (A, B, C&#x2026;) and the traditional accidentals (sharp, double-sharp,
flat&#x2026;) are denoting tones in a Pythagorean tuning (when the notation is read as a JI
notation), i.e. the traditional nominals and accidentals notate all the pitches we can reach
when stacking just fifths (plus their octaves). The core idea of these JI pitch notations is
that they introduce a new accidental for the comma (<a href="https://en.wikipedia.org/wiki/Comma_(music)">https://en.wikipedia.org/wiki/Comma_(music)</a>)
of every prime limit (<a href="https://en.wikipedia.org/wiki/Limit_(music)">https://en.wikipedia.org/wiki/Limit_(music)</a>). These notations
mainly differ in what kind of symbols they propose for these comma-accidentals.
</p>

<p>
The JI notation of this library is based on the same principle idea. We notate Pythagorean
nominals and accidentals using the standard OMN pitch notation. Here is a dominant seventh
chord, which in a JI interpretation would be tuned in Pythagorean tuning.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setf pythagorean-seventh '(h c4e4g4bb4))
</pre>
</div>


<p>
We can play this chord in JI with the TOT macro <code>def-tempered-score</code>. This macro does almost
exactly what the Opusmodus builtin <code>def-score</code> does, but it additionally receives a temperament as
one of its arguments. Also, there are multiple MIDI channels specified per instrument, as
simultaneous tones are played on different MIDI channels, so they can be tuned individually by
pitch bend (the macro uses the <code>def-score</code> tuning argument in the background).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(def-tempered-score score-name
    (<span class="org-builtin">:temperament</span> '31-limit-JI
     <span class="org-builtin">:time-signature</span> '(4 4))
  (instr1
   <span class="org-builtin">:omn</span> pythagorean-seventh
   <span class="org-builtin">:channel</span> '(1 2 3 4)
   <span class="org-builtin">:sound</span> 'gm))
</pre>
</div>

<p>
OK, how about instead of the Pythagorean third we want to use a just major third &#x2013; and also a
harmonic seventh and the 11ths overtone? All pitches that go beyond Pythagorean tuning are
notated using JI accidentals that express microtonal comma inflections. 
</p>

<p>
I suggest we use the letter <code>K</code> for marking any OMN attribute that serves as a Komma
accidental,<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> and then
to simply complement that letter with the digits of the prime of the comma in question. So, the
OMN accidental for the <a href="https://en.wikipedia.org/wiki/Syntonic_comma">5-limit comma (the syntonic comma)</a> is notated <code>5K</code>, the <a href="https://en.wikipedia.org/wiki/Septimal_comma%20">7-limit comma</a> is
notated <code>7K</code> and so forth. These accidentals raise the pitch by that comma. For a comma flat, put
a minus in front of the accidental, e.g., <code>-5K</code>. So, here is how we can notate and play<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> the just harmonic seventh chord.  <code>1K</code> is the natural sign, and
multiple accidental attributes for a chord are assigned in ascending order of chord tones.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(setf 7-limit-seventh '(h c4e4g4bb4 1K+-5K+1K+-7K))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-lisp">(def-tempered-score score-name
    (<span class="org-builtin">:temperament</span> '31-limit-JI
     <span class="org-builtin">:time-signature</span> '(4 4))
  (instr1
   <span class="org-builtin">:omn</span> 7-limit-seventh
   <span class="org-builtin">:channel</span> '(1 2 3 4)
   <span class="org-builtin">:sound</span> 'gm))
</pre>
</div>

<p>
JI leads to an infinite number of different pitches. Temperaments reduce that number. So, how about
we want to play the above chord in, say, 22-tone equal temperament
(<a href="https://en.xen.wiki/w/22edo">https://en.xen.wiki/w/22edo</a>). We only need to define that temperament. Each regular
temperament (including all equal temperaments and also JI) is specified by only two settings: a small
number of generator intervals, and a val for each generator. The vals together specify how each
prime (up to the prime limit of the temperament) it is mapped to JI. These details are explained
in the next section. For now, the following code simply shows the definition of 22-EDO, which is pretty brief. 
</p>

<div class="org-src-container">
<pre class="src src-lisp">(deftemperament 7-limit-22-EDO
    <span class="org-comment-delimiter">;; </span><span class="org-comment">List of vals</span>
    (list (list 22
                (+ 13 22)
                (+ 7 (* 2 22))
                (+ 18 (* 2 22))))
  <span class="org-comment-delimiter">;; </span><span class="org-comment">List of generators</span>
  (list (/ 1200.0 22)))
</pre>
</div>

<p>
After we defined 22-EDO this say, we can play the above chord (and any other 7-limit OMN
intervals) in this temperament.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(def-tempered-score score-name
    (<span class="org-builtin">:temperament</span> '17-limit-22-EDO
     <span class="org-builtin">:time-signature</span> '(4 4))
  (instr1
   <span class="org-builtin">:omn</span> 7-limit-seventh
   <span class="org-builtin">:channel</span> '(1 2 3 4)
   <span class="org-builtin">:sound</span> 'gm))
</pre>
</div>
</div>
</div>


<div id="outline-container-org01db866" class="outline-3">
<h3 id="org01db866"><span class="section-number-3">3.3</span> Defining temperaments and scales</h3>
<div class="outline-text-3" id="text-3-3">
<p>
We can define arbitrary regular temperaments simply by specifying their vals and generators. This
section briefly introduces these concept, so that you can define your own temperaments. We will
first define the temperament for 12-tone equal temperament (12-EDO), because that is most widely
used and best understood by most Western musicians. 
</p>

<p>
All pitches of a regular temperament are specified by a small number of <i>generators</i>. For an
equal temperament like 12-EDO, we only need a single generator. We can use the semitone of this
temperament as its generator. All tones of the temperament 12-EDO can then be derived by
stacking that interval multiple times. The semitone of 12-EDO and thus our generator is tuned to
100 <a href="https://en.wikipedia.org/wiki/Cent_(music)">cents</a>.
</p>

<p>
The <a href="https://en.xen.wiki/w/Val"><i>vals</i></a> of a temperament specify how the intervals of the prime frequency ratios 2, 3,
5&#x2026; up to the prime limit of our temperament are mapped to intervals in this temperament. 
</p>

<p>
<b>TODO</b>
</p>


<div class="org-src-container">
<pre class="src src-lisp">(deftemperament 11-limit-12-EDO
    (list (edo-val 12 '(0 7 4 10 6)))
  '(100.0)
  <span class="org-string">"12-EDO temperament with an 11-limit mapping."</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-org7bbb358" class="outline-3">
<h3 id="org7bbb358"><span class="section-number-3">3.4</span> Obtaining information</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org06f1acf" class="outline-4">
<h4 id="org06f1acf"><span class="section-number-4">3.4.1</span> Information on intervals</h4>
</div>


<div id="outline-container-org27629e0" class="outline-4">
<h4 id="org27629e0"><span class="section-number-4">3.4.2</span> Information on scales</h4>
</div>
</div>


<div id="outline-container-orgd2ac3a4" class="outline-3">
<h3 id="orgd2ac3a4"><span class="section-number-3">3.5</span> Defining harmony</h3>
</div>


<div id="outline-container-org86f9868" class="outline-3">
<h3 id="org86f9868"><span class="section-number-3">3.6</span> Constraining music to an underlying harmony</h3>
</div>
