docs/tutorial/tutorial.org
** Dynamic temperaments
   
   At a later stage, the library is also meant to support dynamic temperaments, so that the tuning
   can change during the course of a piece, but the implementation of dynamic temperaments is
   still unfinished.



* Form

  =fn-unfold= 



* Karnatic rhythms 

** Creating a higher-level plan


** Filling in details



* COMMENT Test

#+begin_src lisp
(+ 1 2)
#+end_src

#+RESULTS:
: 3
